package test;

// 이건 라인 주석입니다. 컴파일시엔 모두 무시됩니다.

/*
 * 이건 블락 주석입니다.
 * 
 * 이 내부의 모든 것들은 무시됩니다.
 * 
 * 클래스 이름 규칙: 반드시 첫 자는 대문자로 시작하고,
 * 한단어 이상인 경우, 두 번째 단어의 첫 자도 대문자화 하는 게 좋음.
 * 숫자나 특수문자($,_ 제외)는 클래스 이름의 첫 자로 올 수 없음.
 * 한글 가능하나 아무도 사용하지 않음.
 * 
 * 하나의 자바 파일에는 하나 이상의 클래스를 정의 할 수 있음.
 * 이때 저장된 파일명의 클래스가 대표 클래스가 되고, 
 * 이 클래스만 public 키워드를 가질 수 있음
 * 또한 이 클래스가 main()을 가지게 됨.
 * 
 */

class Dosome {

}

class Any {

}

public class Convention {

	public static void main(String[] args) {

		/*
		 * 자바의 모든 구문(변수 선언, 초기화, 대입 등의 구문에는 
		 * 반드시 ;를 사용해서 끝을 나타내야 함)
		 */

		int a;
	}

}
