package test;
/*
 * 자바 패키지: 프로그래밍을 하다보면 많은 소스 및 클래스가 발생하는데,
 * 이를 목적별로 그룹으로 묶어서 관리하도록 하는 개념이다.
 * 자바에서는 모든 클래스는 반드시 패키지에 속하도록 하고 있는데,
 * 윈도우에서는 패키지를 폴더처럼 구분한다.(모양)
 * 반드시 코드의 첫 줄에 작성.
 * 
 * 패키지는 일반적으로 . 을 이용해서 url 형식을 취하고 있다.
 * 
 * 예를 들면, 자바에서 개발할 때 자주 사용되는 일반 클래스는 
 * 모두 java.lang이라는 패키지에 모여 있다.
 * 이를 이용해서 우리는 개발할 때 사용되는 클래스 및 인터페이스를 적절히 선택해서 사용한다.
 * 
 * 패키지는 종속 관계가 허용되지 않는다. 
 * 즉 a 패키지 내부에 b 패키지가 들어갈 수 없다는 뜻
 * 패키지 이름이 틀리면 무조건 다른 패키지이다.
 * 
 * 이처럼 패키지가 분리된 API(클래스 등)을 사용할 때는 
 * import 라는 키워드를 이용해서 패키지 내의 API를 가져다 사용해야 한다.
 */

public class PackageExam {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
